## Python Exam

In [172]:
import pandas as pd

### Q.1 Count all letters, digits, and special symbols from a given string

str1 = "I@#ma26rt^&ic5us"

In [173]:
str1 = "I@#ma26rt^&ic5us"

In [174]:
str1

'I@#ma26rt^&ic5us'

In [175]:
digit = []
letters = []
special = []
for i in str1:
    if i.isdigit():
        digit.append(i)
    elif i.isalpha():
        letters.append(i)
    else:
        special.append(i)
    
print("letters are : {}".format(letters))
print("Count of letters is",len(letters))
print()
print("digits are  : {}".format(digit))
print("Count of digit is",len(digit))
print()
print("special symbols are : {}".format(special))
print("Count of special symbols is",len(special))

letters are : ['I', 'm', 'a', 'r', 't', 'i', 'c', 'u', 's']
Count of letters is 9

digits are  : ['2', '6', '5']
Count of digit is 3

special symbols are : ['@', '#', '^', '&']
Count of special symbols is 4

## Q.2  Write a Python program to find numbers divisible by nineteen or thirteen from a list of numbers using Lambda.
a=[19, 65, 57, 39, 152, 639, 121, 44, 90, 190]

In [176]:
a = [19, 65, 57, 39, 152, 639, 121, 44, 90, 190]
l1 = list(filter(lambda x:x%19 == 0 or x%13 == 0,a))

In [177]:
l1  # these are the numbers which are divisible by 19 & 13

[19, 65, 57, 39, 152, 190]

## Q.3 Find all of the words in a string that are less than 5 letters.
string = "Practice Problems to Drill List Comprehension in 
Your Head."

In [178]:
string = "Practice Problems to Drill List Comprehension in Your Head."
l2 = list(string.split())

In [179]:
for i in l2:
    if len(i)<5:
        print(i)

to
List
in
Your

## Q4. Calculate income tax for the given income by adhering to the below rules:

Taxable income Rate (in %)
First $10,000 0
Next $10,000 10
The remaining 20

Expected Output:
For example, suppose the taxable income is 45000 the 
income tax payable is:
10000 0% + 10000 10% + 25000 20% = $6000.

In [180]:
def tax_amt (amt):
    amt = int(amt)
    total = 0
    if amt > 20000:
        total = 1000 + ((amt -20000)*.2)
    elif (amt > 10000) and (amt<=20000):
        total = (amt - 10000)*.1
    else:
        total = 0
    print("The tax amount to paid is: ", total,"$")

In [181]:
tax_amt(45000)

The tax amount to paid is:  6000.0 $

## Q5. Given below are the list of positive and negative words. Also,a list of tweets is provided. Separate out the positive and negative comments.

positive = ['good','awesome', 'best', 'nice']

negative = ['worst','awful', 'bad']

tweets = ['This government policies are good', 'bad 
implementation', 'The way he played showed that he is one 
of the best players in the world', 'Her acting in the play was 
awesome', 'The wine tastes awful', 'It's nice to hear this little 
kid's laugh']

In [182]:
positive = ['good','awesome', 'best', 'nice']
negative = ['worst','awful', 'bad']

tweets = ['This government policies are good', 'bad implementation', 'The way he played showed that he is one of the best players in the world', 'Her acting in the play was awesome', 'The wine tastes awful', "It's nice to hear this little kid's laugh"]

In [183]:
p_comm = []
n_comm = []
for i in tweets:
    for j in positive:
        if j.lower() in i.lower():
            p_comm.append(i)
    for k in negative:
        if k.lower() in i.lower():
            n_comm.append(i)
print("Positive Comments: ",p_comm)
print("Negative Comments: ",n_comm)

Positive Comments:  ['This government policies are good', 'The way he played showed that he is one of the best players in the world', 'Her acting in the play was awesome', "It's nice to hear this little kid's laugh"]
Negative Comments:  ['bad implementation', 'The wine tastes awful']

## 6. Extend nested list by adding the sublist.

You have given a nested list. Write a program to extend it by 
adding the sublist ["h", "i", "j"] in such a way that it will look 
like the following list.
list1 = ["a", "b", ["c", ["d", "e", ["f", "g"], "k"], "l"], "m", "n"]
sub list to add
sub_list = ["h", "i", "j"]
expected output =['a', 'b', ['c', ['d', 'e', ['f', 'g', 'h', 'i', 'j'], 'k'], 'l'], 
'm', 'n']

In [184]:
list1 = ["a", "b", ["c", ["d", "e", ["f", "g"], "k"], "l"], "m", "n"]

In [185]:
sub_list = ["h", "i", "j"]

In [186]:
list1[2][1][2].extend(sub_list)

In [187]:
list1 # final output

['a', 'b', ['c', ['d', 'e', ['f', 'g', 'h', 'i', 'j'], 'k'], 'l'], 'm', 'n']

### Q7. Remove and add item in a list.

Write a program to remove the item present at index 4 and 
add it to the 2nd position and at the end of the list.
list1 = [54, 44, 27, 79, 91, 41]

In [188]:
list1 = [54, 44, 27, 79, 91, 41]

In [189]:
rmv = list1.pop(4)
rmv

91

### 2nd position

In [190]:
list1.insert(2,rmv)

In [191]:
list1

[54, 44, 91, 27, 79, 41]

### end of the list

In [192]:
list1.append(rmv)

In [193]:
list1

[54, 44, 91, 27, 79, 41, 91]

### Q8. Load the iris dataset and Find only those records whose sepal_length = 5.1 and sepal_width = 3.5

In [194]:
import seaborn as sns

In [195]:
df = sns.load_dataset('iris')

In [196]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [197]:
df[(df.sepal_length == 5.1) & (df.sepal_width==3.5)]

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
17           5.1          3.5           1.4          0.3  setosa

### Q9. Check for Maximum petal_length and convert it in to 7.2 and min petal_length and convert it in to 1.2

In [198]:
df[df["petal_length"]==df["petal_length"].max() ]

     sepal_length  sepal_width  petal_length  petal_width    species
118           7.7          2.6           6.9          2.3  virginica

In [199]:
df.petal_length.max()

6.9

In [200]:
df[df["petal_length"]==df["petal_length"].min() ]

    sepal_length  sepal_width  petal_length  petal_width species
22           4.6          3.6           1.0          0.2  setosa

In [201]:
df.petal_length.min()

1.0

In [202]:
max_petal_length = df.petal_length.max()

In [203]:
min_petal_length = df.petal_length.min()

In [204]:
df.loc[df['petal_length'] == max_petal_length, 'petal_length'] = 7.2
df.loc[df['petal_length'] == min_petal_length, 'petal_length'] = 1.2

### After Conversion

In [205]:
df[df["petal_length"]==df["petal_length"].max() ]

     sepal_length  sepal_width  petal_length  petal_width    species
118           7.7          2.6           7.2          2.3  virginica

In [206]:
df[df["petal_length"]==df["petal_length"].min() ]

    sepal_length  sepal_width  petal_length  petal_width species
13           4.3          3.0           1.1          0.1  setosa

In [207]:
df.petal_length.max()

7.2

In [208]:
df.petal_length.min()

1.1

### Q10. Perform right join to combine values based on the 'ID' in the two dataframes.
Use the dataframe given below, read the DataFrame with the 
help of clipboard function.

In [217]:
df_clip = pd.read_clipboard()

In [218]:
df_clip

    ID Candidate_Name    Subject
0  101           Alex    History
1  102            Amy    English
2  103          Allen  Geography
3  104          Alice     German
4  105          James    History
5  106           Sara     German
6  107            Mia    English

In [221]:
df_clip2 = pd.read_clipboard()

In [222]:
df_clip2

    ID       City  Subject_Score
0  101      Delhi             89
1  102     Mumbai             78
2  103      Delhi             77
3  104    Chennai             87
4  105  Hyderabad             87
5  108      Delhi             84

In [223]:
Final_df = pd.merge(df_clip,df_clip2,how = 'right',on = 'ID')

In [224]:
Final_df

    ID Candidate_Name    Subject       City  Subject_Score
0  101           Alex    History      Delhi             89
1  102            Amy    English     Mumbai             78
2  103          Allen  Geography      Delhi             77
3  104          Alice     German    Chennai             87
4  105          James    History  Hyderabad             87
5  108            NaN        NaN      Delhi             84